NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54ls05a/nrf54ls05a_application.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM20">
      <name>GLOBAL_SPIM21</name>
      <description>Serial Peripheral Interface Master with EasyDMA 1</description>
      <baseAddress>0x400C7000</baseAddress>
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS20">
      <name>GLOBAL_SPIS21</name>
      <description>SPI Slave 1</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21</alternatePeripheral>
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20">
      <name>GLOBAL_TWIM21</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 1</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21</alternatePeripheral>
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20">
      <name>GLOBAL_TWIS21</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 1</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21</alternatePeripheral>
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE20">
      <name>GLOBAL_UARTE21</name>
      <description>UART with EasyDMA 1</description>
      <baseAddress>0x400C7000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM21</alternatePeripheral>
      <interrupt>
        <name>SERIAL21</name>
        <value>199</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM20">
      <name>GLOBAL_SPIM22</name>
      <description>Serial Peripheral Interface Master with EasyDMA 2</description>
      <baseAddress>0x400C8000</baseAddress>
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS20">
      <name>GLOBAL_SPIS22</name>
      <description>SPI Slave 2</description>
      <baseAddress>0x400C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22</alternatePeripheral>
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM20">
      <name>GLOBAL_TWIM22</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 2</description>
      <baseAddress>0x400C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22</alternatePeripheral>
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS20">
      <name>GLOBAL_TWIS22</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 2</description>
      <baseAddress>0x400C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22</alternatePeripheral>
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE20">
      <name>GLOBAL_UARTE22</name>
      <description>UART with EasyDMA 2</description>
      <baseAddress>0x400C8000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM22</alternatePeripheral>
      <interrupt>
        <name>SERIAL22</name>
        <value>200</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_EGU00">
      <name>GLOBAL_EGU20</name>
      <description>Event generator unit 2</description>
      <baseAddress>0x400C9000</baseAddress>
      <interrupt>
        <name>EGU20</name>
        <value>201</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00">
      <name>GLOBAL_TIMER20</name>
      <description>Timer/Counter 2</description>
      <baseAddress>0x400CA000</baseAddress>
      <interrupt>
        <name>TIMER20</name>
        <value>202</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_MEMCONF</name>
      <description>Memory configuration</description>
      <baseAddress>0x400CF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>MEMCONF</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>POWER[%s]</name>
          <description>Unspecified</description>
          <headerStructName>MEMCONF_POWER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>Description cluster: Control memory block power.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MEM0</name>
                <description>Keep the memory block MEM[0] on or off when in System ON mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM1</name>
                <description>Keep the memory block MEM[1] on or off when in System ON mode.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM2</name>
                <description>Keep the memory block MEM[2] on or off when in System ON mode.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM3</name>
                <description>Keep the memory block MEM[3] on or off when in System ON mode.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM4</name>
                <description>Keep the memory block MEM[4] on or off when in System ON mode.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM5</name>
                <description>Keep the memory block MEM[5] on or off when in System ON mode.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM6</name>
                <description>Keep the memory block MEM[6] on or off when in System ON mode.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM7</name>
                <description>Keep the memory block MEM[7] on or off when in System ON mode.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM8</name>
                <description>Keep the memory block MEM[8] on or off when in System ON mode.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM9</name>
                <description>Keep the memory block MEM[9] on or off when in System ON mode.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM10</name>
                <description>Keep the memory block MEM[10] on or off when in System ON mode.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM11</name>
                <description>Keep the memory block MEM[11] on or off when in System ON mode.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM12</name>
                <description>Keep the memory block MEM[12] on or off when in System ON mode.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM13</name>
                <description>Keep the memory block MEM[13] on or off when in System ON mode.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM14</name>
                <description>Keep the memory block MEM[14] on or off when in System ON mode.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM15</name>
                <description>Keep the memory block MEM[15] on or off when in System ON mode.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM16</name>
                <description>Keep the memory block MEM[16] on or off when in System ON mode.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM17</name>
                <description>Keep the memory block MEM[17] on or off when in System ON mode.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM18</name>
                <description>Keep the memory block MEM[18] on or off when in System ON mode.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM19</name>
                <description>Keep the memory block MEM[19] on or off when in System ON mode.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM20</name>
                <description>Keep the memory block MEM[20] on or off when in System ON mode.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM21</name>
                <description>Keep the memory block MEM[21] on or off when in System ON mode.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM22</name>
                <description>Keep the memory block MEM[22] on or off when in System ON mode.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM23</name>
                <description>Keep the memory block MEM[23] on or off when in System ON mode.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM24</name>
                <description>Keep the memory block MEM[24] on or off when in System ON mode.</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM25</name>
                <description>Keep the memory block MEM[25] on or off when in System ON mode.</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up</description>
                    <value>0x1</value>
